/*
 * @Author: Topskys
 * @Date: 2022-10-25 23:44:10
 * @LastEditTime: 2022-10-26 15:20:30
 */
/**
 * ??：空值合并运算符，如左侧操作数为null or undefined，返回右侧操作数；如左侧操作数不为null且undefined，返回左侧操作数。
 */
const a = null ?? any  // 与 || 不同的是，左侧操作数为0时可赋值，返回左侧操作数

/**
 * ?.：可选链运算符，。
 */
const b = null ?? any  // 与 || 不同的是，左侧操作数为0时可赋值，返回左侧操作数


/**
 * ||=：逻辑或赋值。
 */


/**
 * &&=：。
 */

/**
 * ??=：。
 */

/**
 * >>=：。
 */

/**
 * **：求幂运算符，等价于Math.paw()。
 */

/**
 * ^：。
 */


/**
 * &=：。
 */


/**
 *!：。
 */
/**
 * =>：。
 */
/**
 * >>>：。
 */


/**
 * >>>=：右移赋值符。
 */



/**
 * ~：位非(补)NOT，用于对一个二进制操作数逐位进行取反操作。
 */

/**
 *...：扩展运算符。
 */